* TODO
** DONE Make a schematic for the oscillator in Eagle and Wire it

* Questions
  - [ ] The manually made voltage regulator: would it be a problem for the later PCB layout
  - [ ] The oscillator in the schematic may differ from the part we picked on digkey 
  - [ ] There are too many extra components for the voltage regulator, is that a problem?
  - [ ] May want to have a capacitor for each motor?

  - [X] What are the criteria to choose Push buttons and Oscillator?
    + Push button as small as possible > 0603
  - [X] Motor Driver Pull Up/Down at the MOSFET???
    + Jose got it
  - [X] Where should we put the LEDs?
    + Wherever that serves a testing purpose
* Schematic
** Get the components
  - MCU, IMU, RF, FTDI are in the AP library under quad
  - Reuse the motor driver schematic from Lab3
  - The voltage regulator needs to be made manually (pain)
** Wiring
   - Everything should be connected using net (change wire to net in motor drive)
   - For most components, just connect the corresponding VCC and GND to the Atmega328p
   - For other pins, connect them to the associated pin on the Atmega328p; otherwise, look up the connection from previous labs
** Adding Capacitors
   - 100muF across the battery (JST) to help provide current to motors
   - Decoupling capacitors needed for Atmega328p, three 100nF across AVcc, Vcc, and AREF
   - 10muF and 100nF decoupling capacitor across the RF module
   - NOTE that it may seem that all capacitors are essentially across VCC and GND, however in the actual PCB there are inductance across wires, therefore we put associated coupling capacitors as close as possible
** Reset circuit
   - 100nF capacitor across DTR and RS
   - Resistor to pull voltage up across Batter and RS
   - a push button across RS and GND
* Part Choosing Requirements (everything SMD and mostly 0603)
  - Voltage regulator (3.3V, >100mA)
    + RF: 13.5mA
    + IMU: 3.9mA
  - Oscillator
    + Operating frequency 0-10MHz (from microcontroller datasheet)
    + 0603
  - MOSFET
    + Threshold = 1V
    + On Resistance = <0.06
    + Maximum operating voltage/current = 6.5
    + Thermal Resistance and maximum operating temperature = [38 [1] or 100 -55-150]
      [1] When mounted on 1 inch2 FR-4 board, 2 oz. Cu., t < 10 s
    + I^2R = 3^2 * 0.06 = 0.54 = W; W*38 = 20 degree changes <-- we are good
  - Diode (4A continuously)
  - Capacitors (0603)
    + SMD and matches the value and dimension
  - Resistors (0603)
  - LED 
  - Push button
    
* Problems from 1st Design Review
  - [X] Higher current power supply <-- 150mA
  - [X] Packages are incorrect <--changed
  - [X] Resistor is way too small <--0603
  - [X] 0603 for most passives <--fixed
  - [X] Don’t used a stacked 100uF capacitor <--fixed
  - [X] Know why you’re choosing parts <--ofc
  - [X] Use a correct motor driver circuit <--correced
  - [X] Don’t use two batteries <--only one JBT 
  - [X] Use the correct components (e.g. don’t use NMOS for PMOS, JST for battery) <--motor driver
  - [X] Missing MCU reset pin components <--reset circuit completed
  - [X] Why is there an LED from DTR to GND? <--reset circuit completed
  - [X] Incomplete reset circuit <--reset circuit completed
  - [X] Unconnected ground pins on MCU
  - [X] Voltage divider is for BATTERY VOLTAGE, not REGULATED VOLTAGE (regulated voltage shouldn’t be changing!) <--fixed
  - [ ] Check package in schematic matches package in BOM <--
  - [ ] Fix all ERC (except “POWER pin X connected to Y”)
  - [ ] Missing oscillator
  - [ ] Create library and wiring for voltage regulator
  
* Parts Needed to be bought
| Description                     | Datasheet | Vendor  | Vendor Part #           | Manufacturer                     | Part #               | Package                                | Quantity | Unit Price | Total Cost | Link |
|---------------------------------+-----------+---------+-------------------------+----------------------------------+----------------------+----------------------------------------+----------+------------+------------+------|
| Microcontroller                 | [[http://www.atmel.com/Images/Atmel-42735-8-bit-AVR-Microcontroller-ATmega328-328P_Datasheet.pdf][link]]      | Digikey | ATMEGA328P-AU-ND        | Microchip                        | ATMEGA328P-AU        | 32-TQFP                                |        1 |       2.13 |       2.13 | [[http://www.digikey.com/product-detail/en/microchip-technology/ATMEGA328P-AU/ATMEGA328P-AU-ND/1832260][link]] |
| Voltage Regulator (Buck, Boost) | [[https://datasheets.maximintegrated.com/en/ds/MAX1672.pdf][link]]      | DigiKey | MAX1672EEE+T-ND         | Maxim Integrated                 | MAX1672EEE+T         | 16-SSOP (0.154", 3.90mm Width)         |        1 |       3.32 |       3.32 | [[https://www.digikey.com/product-detail/en/maxim-integrated/MAX1672EEE-T/MAX1672EEE-T-ND/1515219][link]] |
| 100 uF capacitor                | [[http://search.muratalink.co.jp/Ceramy/image/img/A01X/G101/ENG/GRM31CD80J107ME39-01.pdf][link]]      | DigiKey | 490-10525-2-ND          | Murata Electronics North America | GRM31CD80J107ME39L   | [1206]                                 |        3 |       0.13 |       0.39 | [[https://www.digikey.com/product-detail/en/murata-electronics-north-america/GRM31CD80J107ME39L/490-10525-2-ND/5027609][link]] |
| 10 uF capacitor                 | [[https://www.yuden.co.jp/productdata/catalog/mlcc_all_e.pdf][link]]      | DigiKey | 587-1256-2-ND           | Taiyo Yuden                      | JMK107BJ106MA-T      | [0603]                                 |        1 |       0.02 |       0.02 | [[https://www.digikey.com/product-detail/en/taiyo-yuden/JMK107BJ106MA-T/587-1256-2-ND/930608][link]] |
| 100 nF capacitor                | [[https://www.yuden.co.jp/productdata/catalog/mlcc_all_e.pdf][link]]      | DigiKey | 587-1245-1-ND           | Taiyo Yuden                      | TMK107BJ104KA-T      | [0603]                                 |        6 |       0.01 |       0.06 | [[https://www.digikey.com/product-detail/en/taiyo-yuden/TMK107BJ104KA-T/587-1245-1-ND/931022][link]] |
| LED                             | [[http://optoelectronics.liteon.com/upload/download/DS22-2000-222/LTST-C191KFKT.pdf][link]]      | DigiKey | 160-1445-2-ND           | Lite-On Inc                      | LTST-C191KFKT        | [0603]                                 |        2 |       0.04 |       0.08 | [[https://www.digikey.com/product-detail/en/lite-on-inc/LTST-C191KFKT/160-1445-2-ND/386833][link]] |
| 2.2 kOhm Resistor               | [[https://www.mouser.com/ds/2/427/crcw0201e3-239671.pdf][link]]      | Mouser  | 667-ERJ-3EKF2201V       | Panasonic Industrial Devices     | ERJ-3EKF2201V        | [0603]                                 |        2 |      $0.22 |       0.44 | [[https://www.mouser.com/ProductDetail/Vishay/CRCW02012K20JNED?qs%3DsGAEpiMZZMvdGkrng054tx3Kv%25252bhbWMRFaxxOJx%25252bImNQ%253d][link]] |
| MOSFET                          | [[http://www.st.com/content/ccc/resource/technical/document/datasheet/04/34/f3/84/3e/6f/4c/eb/CD00002146.pdf/files/CD00002146.pdf/jcr:content/translations/en.CD00002146.pdf][link]]      | DigiKey | 497-4525-6-ND           | STMicroelectronics               | STN4NF03L            | SOT-233                                |        4 |      $1.33 |       5.32 | [[https://www.digikey.com/product-detail/en/stmicroelectronics/STN4NF03L/497-4525-6-ND/1848877][link]] |
| Diode                           | [[https://www.mouser.com/ds/2/54/D0603_1005-777241.pdf][link]]      | Mouser  | 652-CD0603-S01575       | Bourns                           | CD0603-S01575        | [0603]                                 |        5 |        0.4 |          2 | [[https://www.mouser.com/ProductDetail/Bourns/CD0603-S01575?qs%3DFITO%252f%252fQgYDlmbwJLjhqThQ%253d%253d][link]] |
| 10 kOhm Resistor                | [[https://www.mouser.com/ds/2/447/PYu-RE_105_RoHS_L_6-1116121.pdf][link]]      | Mouser  | 603-RE0603BRE0710KL     | Yageo                            | RE0603BRE0710KL      | [0603]                                 |        5 |       0.35 |       1.75 | [[https://www.mouser.com/ProductDetail/Yageo/RE0603BRE0710KL?qs%3DsGAEpiMZZMvdGkrng054t%252fEV866paE0hhMI%252fxeoFNEJCU72vYWvGgQ%253d%253d][link]] |
| Pushbutton Switch               | [[https://www.mouser.com/ds/2/140/P090002-267756.pdf][link]]      | Mouser  | 612-LL3301NF065QG       | E-Switch                         | LL3301NF065QG        | 6mmx6mmx4.3mm                          |        1 |       0.57 |       0.57 | [[https://www.mouser.com/ProductDetail/E-Switch/LL3301NF065QG?qs%3DsGAEpiMZZMvxtGF7dlGNpqqmTFthXBmf0KM%25252bqj1KR%25252bA%253d][link]] |
| Oscillator                      | [[http://cds.linear.com/docs/en/datasheet/6930fe.pdf][link]]      | DigiKey | LTC6930CMS8-8.19#PBF-ND | Linear Technology/Analog Devices | LTC6930CMS8-8.19#PBF | 8-TSSOP, 8-MSOP (0.118", 3.00mm Width) |        1 |       2.72 |       2.72 | [[https://www.digikey.com/product-detail/en/linear-technology-analog-devices/LTC6930CMS8-8.19-PBF/LTC6930CMS8-8.19-PBF-ND/1927830][link]] |
| Inductor                        | [[http://search.murata.co.jp/Ceramy/image/img/P02/JELF243B-0012.pdf][link]]      | DigiKey | 490-4025-2-ND           | Murata Electronics North America | LQM18FN100M00D       | [0603]                                 |        1 |       0.05 |       0.05 | [[https://www.digikey.com/product-detail/en/murata-electronics-north-america/LQM18FN100M00D/490-4025-2-ND/1016184][link]] |
| 4.7 uF capacitor                | [[http://www.samsungsem.com/kr/support/product-search/mlcc/__icsFiles/afieldfile/2016/08/18/S_CL10A475KQ8NNNC.pdf][link]]      | DigiKey | 1276-1045-2-ND          | Samsung Electro-Mechanics        | CL10A475KQ8NNNC      | [0603]                                 |        1 |       0.01 |       0.01 | [[https://www.digikey.com/product-detail/en/samsung-electro-mechanics/CL10A475KQ8NNNC/1276-1045-2-ND/3886703][link]] |
| 1mOhm resistor                  | [[http://www.te.com/commerce/DocumentDelivery/DDEController?Action%3Dsrchrtrv&DocNm%3D1773200&DocType%3DDS&DocLang%3DEnglish][link]]      | DigiKey | A119955TR-ND            | TE Connectivity Passive Product  | CPF0603B1M0E         | [0603]                                 |        1 |       0.09 |       0.09 | [[https://www.digikey.com/product-detail/en/te-connectivity-passive-product/CPF0603B1M0E/A119955TR-ND/4966442][link]] |
|---------------------------------+-----------+---------+-------------------------+----------------------------------+----------------------+----------------------------------------+----------+------------+------------+------|
| Total Cost                      |           |         |                         |                                  |                      |                                        |          |            |      18.95 |      |
|                                 |           |         |                         |                                  |                      |                                        |          |            |            |      |
#+TBLFM: @17$10=@2$10+@3$10+@4$10+@5$10+@6$10+@7$10+@8$10+@9$10+@10$10+@11$10+@12$10+@13$10+@14$10+@15$10+@16$10

* Why use Charge Pumps over Inductive?
  - AKA switched-capacitor
  - Charge and Discharge of capactior (flying capacitor)
  - Not as efficient as inductive converters
  - Ease to use, small solution size
  - High current draw from the motor won't cause battery voltage to drop
** Doubling Boost
   - switching capacitor charged from input to ground
   - stacking it double the input voltage
   - Regulated: feedback from output
** Buck Charge
   - there is going to be output ripple
   - more efficient 
* Decision: buck-boost converter or a charge-pump regulator
  We choose charge-pump regulator because
